* Problems
  * [X] Images not working on production
* Tasks
** DONE Implement glassmorphism
** TODO PIXI animations
    * [X] rotating icon countdown 
    * [X] figure out what to do with the third tab
    * [ ] optimize each tab
    * [X] better scene management
    * [X] refactor projects scene: 
        * have an array keeping track of how much each entry in projects should slide

** DONE Form handling
   CLOSED: [2023-09-20 Wed 11:33]
  * [X] frontend layout for the form
  * [X] better styling, make bg easier on the eye to read
  * [x] form handling proper
  * [x] basic backend to receive the messages
** TODO Styling general
  * [X] make default text color white
  * [x] host own font
* Portfolio
  :LOGBOOK:
  CLOCK: [2023-09-20 Wed 22:14]--[2023-09-20 Wed 23:51] => 1:37
  CLOCK: [2023-09-20 Wed 18:53]--[2023-09-20 Wed 20:01] => 1:08
  CLOCK: [2023-09-20 Wed 17:25]--[2023-09-20 Wed 17:55] => 0:30
  CLOCK: [2023-09-20 Wed 17:00]--[2023-09-20 Wed 17:14] => 0:14
  CLOCK: [2023-09-20 Wed 13:03]--[2023-09-20 Wed 14:00] => 0:57
  CLOCK: [2023-09-11 Mon 16:58]--[2023-09-11 Mon 17:39] => 0:41
  CLOCK: [2023-09-11 Mon 00:53]--[2023-09-11 Mon 02:41] => 1:48
  CLOCK: [2023-09-10 Sun 19:36]--[2023-09-10 Sun 21:44] => 2:08
  CLOCK: [2023-09-10 Sun 11:51]--[2023-09-10 Sun 13:15] => 1:24
  CLOCK: [2023-09-09 Sat 21:39]--[2023-09-09 Sat 23:37] => 1:58
  CLOCK: [2023-09-08 Fri 23:54]--[2023-09-09 Sat 00:48] => 0:54
  CLOCK: [2023-09-08 Fri 21:17]--[2023-09-08 Fri 22:29] => 1:12
  CLOCK: [2023-09-07 Thu 23:46]--[2023-09-08 Fri 01:35] => 1:49
  CLOCK: [2023-09-07 Thu 22:02]--[2023-09-07 Thu 23:21] => 1:19
  CLOCK: [2023-09-06 Wed 21:00]--[2023-09-06 Wed 23:42] => 2:42
  CLOCK: [2023-09-06 Wed 18:46]--[2023-09-06 Wed 19:54] => 1:08
  CLOCK: [2023-09-06 Wed 14:44]--[2023-09-06 Wed 16:30] => 1:46
  CLOCK: [2023-09-05 Tue 21:23]--[2023-09-05 Tue 23:39] => 2:16
  CLOCK: [2023-09-05 Tue 15:26]--[2023-09-05 Tue 16:58] => 1:32
  CLOCK: [2023-09-03 Sun 17:54]--[2023-09-03 Sun 18:43] => 0:49
  CLOCK: [2023-09-03 Sun 15:30]--[2023-09-03 Sun 16:52] => 1:22
  CLOCK: [2023-09-03 Sun 12:47]--[2023-09-03 Sun 13:34] => 0:47
  CLOCK: [2023-08-29 Tue 21:50]--[2023-08-29 Tue 23:42] => 1:52
  CLOCK: [2023-08-29 Tue 17:15]--[2023-08-29 Tue 18:30] => 1:15
  CLOCK: [2023-08-29 Tue 13:27]--[2023-08-29 Tue 14:10] => 0:43
  CLOCK: [2023-08-25 Fri 22:42]--[2023-08-25 Fri 22:48] => 0:06
  :END:

